app/views/dashboard/mostrar_tropas.html.erb

SELECT  "recursos_por_usuarios".* FROM "recursos_por_usuarios" WHERE "recursos_por_usuarios"."user_id" = ? AND "recursos_por_usuarios"."recurso_id" = ? ORDER BY "recursos_por_usuarios"."id" ASC LIMIT ?  [["user_id", 1], ["recurso_id", 1], ["LIMIT", 1]]
---
        <td><%= tropa.cantidad_rec %></td>
        <% @rec = current_user.recursos_por_usuarios.where(recurso_id: tropa.recurso_id)