app/views/dashboard/mostrar_recursos.html.erb

      <%
        @rec = recurso.recursos_por_usuarios.where(user_id: current_user.id).first
---
SELECT  "recursos_por_usuarios".* FROM "recursos_por_usuarios" WHERE "recursos_por_usuarios"."recurso_id" = ? AND "recursos_por_usuarios"."user_id" = ? ORDER BY "recursos_por_usuarios"."id" ASC LIMIT ?  [["recurso_id", 1], ["user_id", 1], ["LIMIT", 1]]