app/controllers/dashboard_controller.rb

  def mostrar_tropas
    @tropas = Tropa.all
---
SELECT "tropas".* FROM "tropas"

  def adquirir_tropa

     @tropa = Tropa.find(params[:id])

     @new_tropa = @tropa.tropas_por_usuarios.build(:user => current_user)
     @new_tropa.fecha = Time.now
     @new_tropa.curr_atk = @tropa.atk
     @new_tropa.curr_def = @tropa.def
    respond_to do |format|
      if @new_tropa.save
        @recurso = current_user.recursos_por_usuarios.where(recurso_id: @new_tropa.tropa.recurso_id).first
        @cantidad = @recurso.cantidad-@new_tropa.tropa.cantidad_rec
        if @recurso.update_attributes(:cantidad => @cantidad)
---
SELECT  "tropas".* FROM "tropas" WHERE "tropas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tropas_por_usuarios" ("user_id", "tropa_id", "fecha", "curr_atk", "curr_def", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "recursos_por_usuarios".* FROM "recursos_por_usuarios" WHERE "recursos_por_usuarios"."user_id" = ? AND "recursos_por_usuarios"."recurso_id" = ? ORDER BY "recursos_por_usuarios"."id" ASC LIMIT ?  [["user_id", 1], ["recurso_id", 1], ["LIMIT", 1]]
UPDATE "recursos_por_usuarios" SET "cantidad" = ?, "updated_at" = ? WHERE "recursos_por_usuarios"."id" = ?  [["cantidad", 0], ["updated_at", "2017-06-14 20:14:28.480257"], ["id", 1]]

  def mostrar_recursos
    @recursos = Recurso.all
---
SELECT "recursos".* FROM "recursos"

  def retirarse
    @recursos = RecursosPorUsuario.where(user_id: current_user.id)
---
SELECT "recursos_por_usuarios".* FROM "recursos_por_usuarios" WHERE "recursos_por_usuarios"."user_id" = ?  [["user_id", 1]]

  def atacar
    @enemigo = User.where.not(email:current_user.email).order("RANDOM()").first
---
SELECT  "users".* FROM "users" WHERE ("users"."email" != ?) ORDER BY RANDOM() LIMIT ?  [["email", "kenji@kenji.cl"], ["LIMIT", 1]]

  def add_recurso
    @recurso = Recurso.find(params[:id])

    if RecursosPorUsuario.where(user_id: current_user.id, recurso_id: params[:id]).exists?
      @new_recurso = RecursosPorUsuario.where(user_id: current_user.id, recurso_id: params[:id]).first
      @cantidad = @new_recurso.cantidad + 100
      respond_to do |format|
        if @new_recurso.update_attributes(:cantidad => @cantidad, :ultima_fecha => Time.now)
          format.html { redirect_to dashboard_mostrar_recursos_path, notice: '+ 100 ' }
        else
          format.html { redirect_to dashboard_mostrar_tropas_path, notice: 'Error al adquirir recurso' }
        end
      end

    else
      @new_recurso = @recurso.recursos_por_usuarios.build(:user => current_user)
      @new_recurso.cantidad = 100
      @new_recurso.ultima_fecha = Time.now
      respond_to do |format|
        if @new_recurso.save
---
SELECT  "recursos".* FROM "recursos" WHERE "recursos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "recursos_por_usuarios".* FROM "recursos_por_usuarios" WHERE "recursos_por_usuarios"."user_id" = ? AND "recursos_por_usuarios"."recurso_id" = ? ORDER BY "recursos_por_usuarios"."id" ASC LIMIT ?  [["user_id", 1], ["recurso_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "recursos_por_usuarios" WHERE "recursos_por_usuarios"."user_id" = ? AND "recursos_por_usuarios"."recurso_id" = ? LIMIT ?  [["user_id", 1], ["recurso_id", 1], ["LIMIT", 1]]
UPDATE "recursos_por_usuarios" SET "cantidad" = ?, "ultima_fecha" = ?, "updated_at" = ? WHERE "recursos_por_usuarios"."id" = ?  [["cantidad", 100], ["ultima_fecha", "2017-06-14 20:48:23.340308"], ["updated_at", "2017-06-14 20:48:23.347716"], ["id", 1]]
INSERT INTO "recursos_por_usuarios" ("user_id", "recurso_id", "ultima_fecha", "cantidad", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["recurso_id", 1], ["ultima_fecha", "2017-06-14 20:14:03.317931"], ["cantidad", 100], ["created_at", "2017-06-14 20:14:03.319229"], ["updated_at", "2017-06-14 20:14:03.319229"]]