app/controllers/recursos_controller.rb

  def index
  	@recursos = Recurso.all
---
SELECT "recursos".* FROM "recursos"

  def create
    @recurso = Recurso.new(recurso_params)

    respond_to do |format|
      if @recurso.save
---
INSERT INTO "recursos" ("nombre", "created_at", "updated_at") VALUES (?, ?, ?)  [["nombre", "hierro"], ["created_at", "2017-06-14 20:13:43.166884"], ["updated_at", "2017-06-14 20:13:43.166884"]]

    def set_recurso
      @recurso = Recurso.find(params[:id])
---
SELECT  "recursos".* FROM "recursos" WHERE "recursos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]