app/controllers/tipo_tropas_controller.rb

  def index
    @tipo_tropas = TipoTropa.all
---
SELECT "tipo_tropas".* FROM "tipo_tropas"

  def create
    @tipo_tropa = TipoTropa.new(tipo_tropa_params)

    respond_to do |format|
      if @tipo_tropa.save
---
INSERT INTO "tipo_tropas" ("nombre", "boni_atk", "boni_def", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "infantería"], ["boni_atk", 10], ["boni_def", 10], ["created_at", "2017-06-14 20:13:27.313632"], ["updated_at", "2017-06-14 20:13:27.313632"]]

    def set_tipo_tropa
      @tipo_tropa = TipoTropa.find(params[:id])
---
SELECT  "tipo_tropas".* FROM "tipo_tropas" WHERE "tipo_tropas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]