app/controllers/tropas_controller.rb

  def index
    @tropas = Tropa.all
---
SELECT "tropas".* FROM "tropas"

  def new
    @tropa = Tropa.new
    @tipoTropas = TipoTropa.all
    @Recursos = Recurso.all
---
SELECT "tipo_tropas".* FROM "tipo_tropas"
SELECT "recursos".* FROM "recursos"

  def create
    @tropa = Tropa.new(tropa_params)

    respond_to do |format|
      if @tropa.save
---
INSERT INTO "tropas" ("nombre", "atk", "def", "created_at", "updated_at", "tipo_tropa_id", "recurso_id", "cantidad_rec") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_tropa
      @tropa = Tropa.find(params[:id])
---
SELECT  "tipo_tropas".* FROM "tipo_tropas" WHERE "tipo_tropas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "tropas".* FROM "tropas" WHERE "tropas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]